# Cable Size Create Method

Source: https://www.revitapidocs.com/2026/33fcad8c-03fa-cdbf-76ca-784ccae0e2f8.htm

---

| Cable Size Create Method |
| --- |

Creates a Cable Size.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static CableSize Create(
	Document document
)
```

```
Public Shared Function Create (
	document As Document
) As CableSize
```

```
public:
static CableSize^ Create(
	Document^ document
)
```

```
static member Create :
        document : Document -> CableSize
```

#### Parameters

document Document
:   The document.

#### Return Value

CableSize
The newly created Cable Size data. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements). |
| ModificationForbiddenException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements).  \-or\-  The document is being loaded, or is in the midst of another  sensitive process. |
| ModificationOutsideTransactionException | The document has no open transaction. |

See Also

#### Reference

CableSize Class Autodesk.Revit.DB.Electrical Namespace